# FamilyThermalProperties Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties Constructor
FamilyThermalProperties Class See Also
---
Constructs a new FamilyThermalProperties with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FamilyThermalProperties()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FamilyThermalProperties()
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace